simpleFoam/H15V15/D050L474W090Z000H150V015_C_woMount/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0.15 0 0);

boundaryField
{
    bottom
    {
        type            noSlip;
    }
    cylinder
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
1280
(
(0.1171 0 0)
(0.1171 0 0)
(0.117 0 0)
(0.1289 0 0)
(0.1369 0 0)
(0.1288 0 0)
(0.1288 0 0)
(0.1369 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
