simpleFoam/H15V15/D050L474W090Z000H150V015_C_woMount/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.57E-8; 

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
		type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }
    "(bottom|frontAndBack|cylinder)"
    {
        type            kqRWallFunction;
        value           uniform 1E-10; // lowRe 1e-10; 
    }
   
}


// ************************************************************************* //
